// ============================================================================
// 
// タブアイテムの基底用 ViewModel
// 
// ============================================================================

// ----------------------------------------------------------------------------
// ウィンドウではないため、BaseViewModel を継承しない
// T はタブコントロールで扱いたい設定の型
// ----------------------------------------------------------------------------

using Livet;

using System;

namespace Shinta.ViewModels
{
	internal class TabItemViewModel<T> : ViewModel
	{
		// ====================================================================
		// コンストラクター
		// ====================================================================

		// --------------------------------------------------------------------
		// メインコンストラクター
		// --------------------------------------------------------------------
		public TabItemViewModel(TabControlWindowViewModel<T> tabControlWindowViewModel, LogWriter? logWriter = null)
		{
			_tabControlWindowViewModel = tabControlWindowViewModel;
			_logWriter = logWriter;
		}

		// --------------------------------------------------------------------
		// ダミーコンストラクター（Visual Studio・TransitionMessage 用）
		// --------------------------------------------------------------------
		public TabItemViewModel()
		{
			_tabControlWindowViewModel = null!;
		}

		// ====================================================================
		// public 関数
		// ====================================================================

		// --------------------------------------------------------------------
		// 入力されているプロパティーの妥当性を確認
		// ＜例外＞ Exception
		// --------------------------------------------------------------------
		public virtual void CheckProperties()
		{
		}

		// --------------------------------------------------------------------
		// 初期化
		// --------------------------------------------------------------------
		public virtual void Initialize()
		{
			_logWriter?.ShowLogMessage(Common.TRACE_EVENT_TYPE_STATUS, GetType().Name + " 初期化中...");
		}

		// --------------------------------------------------------------------
		// ファイルやフォルダーがドロップされた
		// --------------------------------------------------------------------
		public virtual void PathDropped(String[] pathes)
		{
		}

		// --------------------------------------------------------------------
		// プロパティーから設定に反映
		// --------------------------------------------------------------------
		public virtual void PropertiesToSettings(T destSettings)
		{
		}

		// --------------------------------------------------------------------
		// 設定をプロパティーに反映
		// --------------------------------------------------------------------
		public virtual void SettingsToProperties(T srcSettings)
		{
		}

		// ====================================================================
		// protected 変数
		// ====================================================================

		// ウィンドウのビューモデル
		protected TabControlWindowViewModel<T> _tabControlWindowViewModel;

		// ログ
		protected LogWriter? _logWriter;

		// ====================================================================
		// protected 関数
		// ====================================================================

		// --------------------------------------------------------------------
		// リソース解放
		// --------------------------------------------------------------------
		protected override void Dispose(Boolean isDisposing)
		{
			base.Dispose(isDisposing);

			_logWriter?.ShowLogMessage(Common.TRACE_EVENT_TYPE_STATUS, GetType().Name + " 破棄中...");
		}
	}
}
