// ============================================================================
// 
// 原音設定 1 音分を保持するクラス
// Copyright (C) 2024 by SHINTA
// 
// ============================================================================

// ----------------------------------------------------------------------------
// oto.ini の一行に相当するデータを保持するだけのシンプルなクラス
// ----------------------------------------------------------------------------

// ============================================================================
//  Ver.  |      更新日      |                    更新内容
// ----------------------------------------------------------------------------
//  1.00  | 2024/04/22 (Mon) | C++ 版 Lib UTAU から移植。
// (1.01) | 2024/12/05 (Thu) |   namespace を変更。
// ============================================================================

namespace Shinta.LibUtau;

internal class GenonSettings
{
	// ====================================================================
	// public プロパティー
	// ====================================================================

	/// <summary>
	/// 原音 WAVE ファイルのフルパス
	/// </summary>
	public String FileName
	{
		get;
		set;
	} = String.Empty;

	/// <summary>
	/// オフセット（左ブランク）[ms]
	/// </summary>
	public Double Offset
	{
		get;
		set;
	}

	/// <summary>
	/// 子音部（固定範囲）[ms]
	/// </summary>
	public Double Shiin
	{
		get;
		set;
	}

	/// <summary>
	/// ブランク（右ブランク）[ms]
	/// </summary>
	public Double Blank
	{
		get;
		set;
	}

	/// <summary>
	/// 先行発声 [ms]
	/// </summary>
	public Double PreUtterance
	{
		get;
		set;
	}

	/// <summary>
	/// オーバーラップ [ms]
	/// </summary>
	public Double VoiceOverlap
	{
		get;
		set;
	}
}

