// ============================================================================
// 
// アプリケーション設定をアプリの設定保存用パスに保存する
// Copyright (C) 2014-2019 by SHINTA
// 
// ============================================================================

// ----------------------------------------------------------------------------
// 
// ----------------------------------------------------------------------------

// ============================================================================
//  Ver.  |      更新日      |                    更新内容
// ----------------------------------------------------------------------------
//  -.--  | 2014/12/22 (Mon) | 作成開始。
//  1.00  | 2014/12/22 (Mon) | オリジナルバージョン。
// (1.01) | 2019/01/20 (Sun) |   WPF アプリケーションでも使用可能にした。
// (1.02) | 2019/12/07 (Sat) |   null 許容参照型を有効化した。
// ============================================================================

using System;
using System.Collections.Specialized;

#nullable enable

namespace Shinta
{
	public class ApplicationNameSettingsProvider : ApplicationSettingsProviderBase
	{
		// ====================================================================
		// public メンバー関数
		// ====================================================================

		// --------------------------------------------------------------------
		// コンストラクター
		// --------------------------------------------------------------------
		public ApplicationNameSettingsProvider()
		{
			FileName = Common.UserAppDataFolderPath() + FILE_NAME_USER_CONFIG;
		}

		// --------------------------------------------------------------------
		// 初期化
		// --------------------------------------------------------------------
		public override void Initialize(String oName, NameValueCollection oConfig)
		{
			// 設定プロバイダ名を設定
			base.Initialize("ApplicationNameSettingsProvider", oConfig);
		}

		// ====================================================================
		// private 定数
		// ====================================================================

		private const String FILE_NAME_USER_CONFIG = "user.config";
	}
	// public class ApplicationNameSettingsProvider ___END___

}
// namespace Shinta ___END___

