// ============================================================================
// 
// アプリケーション設定をアプリの設定保存用パスに保存する
// Copyright (C) 2014 by SHINTA
// 
// ============================================================================

// ----------------------------------------------------------------------------
// 
// 
// ----------------------------------------------------------------------------

// ============================================================================
//  Ver.  |      更新日      |                    更新内容
// ----------------------------------------------------------------------------
//  -.--  | 2014/12/22 (Mon) | 作成開始。
//  1.00  | 2014/12/22 (Mon) | オリジナルバージョン。
// ============================================================================

using System;
using System.Collections.Specialized;
using System.IO;
using System.Windows.Forms;

namespace Shinta
{
	public class ApplicationNameSettingsProvider : ApplicationSettingsProviderBase
	{
		// ====================================================================
		// public メンバー関数
		// ====================================================================

		// --------------------------------------------------------------------
		// コンストラクター
		// --------------------------------------------------------------------
		public ApplicationNameSettingsProvider()
		{
			FileName = Path.GetDirectoryName(Application.UserAppDataPath) + "\\" + FILE_NAME_USER_CONFIG;
		}

		// --------------------------------------------------------------------
		// 初期化
		// --------------------------------------------------------------------
		public override void Initialize(String oName, NameValueCollection oConfig)
		{
			// 設定プロバイダ名を設定
			base.Initialize("ApplicationNameSettingsProvider", oConfig);
		}

		// ====================================================================
		// private 定数
		// ====================================================================

		private const String FILE_NAME_USER_CONFIG = "user.config";
	}
}

