// ============================================================================
// 
// ユリウス日を計算するクラス
// Copyright (C) 2015 by SHINTA
// 
// ============================================================================

// ----------------------------------------------------------------------------
// Wikipedia によれば、ユリウス日は Julian Day、修正ユリウス日は Modified Julian Date
// で日付部分の英語表記が異なる。
// ----------------------------------------------------------------------------

// ============================================================================
//  Ver.  |      更新日      |                    更新内容
// ----------------------------------------------------------------------------
//  -.--  | 2015/11/07 (Sat) | 作成開始。
//  1.00  | 2015/11/07 (Sat) | オリジナルバージョン。
// ============================================================================

using System;

namespace Shinta
{
	public class JulianDay
	{
		// ====================================================================
		// public メンバー関数
		// ====================================================================

		// --------------------------------------------------------------------
		// コンストラクター
		// --------------------------------------------------------------------
		public JulianDay()
		{
		}

		// --------------------------------------------------------------------
		// DateTime→（修正じゃない）ユリウス日
		// --------------------------------------------------------------------
		public static Double DateTimeToJulianDay(DateTime oDateTime)
		{
			return (oDateTime.Ticks + (JULIAN_BASE * TICKS_PER_DAY)) / TICKS_PER_DAY;
		}

		// --------------------------------------------------------------------
		// DateTime→修正ユリウス日
		// --------------------------------------------------------------------
		public static Double DateTimeToModifiedJulianDate(DateTime oDateTime)
		{
			return DateTimeToJulianDay(oDateTime) - MJD_DELTA;
		}

		// --------------------------------------------------------------------
		// （修正じゃない）ユリウス日→DateTime
		// --------------------------------------------------------------------
		public static DateTime JulianDayToDateTime(Double oJulianDay)
		{
			return new DateTime((Int64)((oJulianDay - JULIAN_BASE) * TICKS_PER_DAY));
		}

		// --------------------------------------------------------------------
		// 修正ユリウス日→DateTime
		// --------------------------------------------------------------------
		public static DateTime ModifiedJulianDateToDateTime(Double oMjd)
		{
			return JulianDayToDateTime(oMjd + MJD_DELTA);
		}

		// ====================================================================
		// private 定数
		// ====================================================================

		// 1 日を Ticks（100 ナノ秒）で表した数値
		private const Int64 TICKS_PER_DAY = 24L * 60 * 60 * 1000 * 1000 * 10;

		// 0001/01/01 00:00 をユリウス日で表した数値
		private const Double JULIAN_BASE = 1721425.5;

		// 修正ユリウス日 = ユリウス通日 - MJD_DELTA
		private const Double MJD_DELTA = 2400000.5;


	}
}

