// ============================================================================
// 
// ニコニコ動画 API で受信するコンテンツツリー JSON の子動画全体
// 
// ============================================================================

// ----------------------------------------------------------------------------
// 
// ----------------------------------------------------------------------------

namespace Shinta.Niconico.Json;

internal class TreeChildren
{
	// ====================================================================
	// public プロパティー
	// ====================================================================

	/// <summary>
	/// 子動画の数（今回受信した数ではなく、コンテンツツリーに登録されているトータル）
	/// </summary>
	public Int32 Total
	{
		get;
		set;
	}

	/// <summary>
	/// 子動画（今回受信した分）
	/// </summary>
	public TreeVideoInfo[]? Contents
	{
		get;
		set;
	}
}
